#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
int num = 0;
int main()
{
	//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
	//	A选手说：B第二，我第三；
	//	B选手说：我第二，E第四；
	//	C选手说：我第一，D第二；
	//	D选手说：C最后，我第三；
	//	E选手说：我第四，A第一；
	//	比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
	//	0 2 1 0 0		
	//	0 2 0 5 0		
	//	3 4 0 0 0		
	//	0 0 4 0 3    
	//	1 0 0 5 0
	int s[5];
	
	int temp = 0;
	for (s[0] = 1; s[0] < 6; s[0]++)
	{
		for (s[1] = 1; s[1] < 6; s[1]++)
		{
			if (s[0] != s[1])
			for (s[2] = 1; s[2] < 6; s[2]++)
			{
				if (s[0] != s[2] && s[1] != s[2])
				for (s[3] = 1; s[3] < 6; s[3]++)
				{
					if (s[0] != s[3] && s[1] != s[3] && s[2] != s[3])
					for (s[4] = 1; s[4] < 6; s[4]++)
					{
						if (s[0] != s[4] && s[1] != s[4] && s[2] != s[4] && s[3] != s[4])
						{
							if ((s[1] == 2) + (s[2] == 1) == 1 &&
								(s[1] == 2) + (s[3] == 5) == 1 &&
								(s[0] == 3) + (s[1] == 4) == 1 &&
								(s[2] == 4) + (s[4] == 3) == 1 &&
								(s[0] == 1) + (s[3] == 5) == 1)
							{
								for (int i = 0; i < 5; i++)
								{
									printf("第%d名是：%c \n",(i+1),s[i]+64);
								}
								printf("\n");
							}
						}
					}
				}
			}
		}
	}
	system("pause");
	return 0;
}